#' 基础数据
#'
#' @return 返回值
#' @export
#'
#' @examples
#' projectData_basic()
projectData_basic <- function() {

  res <- data.frame(
    id = c('A0014','A0015','A0017','A0018','A0026','A0027','B0001','B0002','B0003','B0004','B0005','B0010','B0012','B0013','B0014'),
    content = c(projectFormatter("A0014-业务流程",'open'),
                projectFormatter("A0015-数据流图",'close') ,
                projectFormatter("A0017-数据字典",'open'),
                projectFormatter("A0018-接口说明",'close'),
                projectFormatter("A0014-业务流程",'open'),
                projectFormatter("A0015-数据流图",'close') ,
                projectFormatter("A0017-数据字典",'open'),
                projectFormatter("A0018-接口说明",'close'),
                projectFormatter("A0014-业务流程",'open'),
                projectFormatter("A0015-数据流图",'close') ,
                projectFormatter("A0017-数据字典",'open'),
                projectFormatter("A0018-接口说明",'close'),
                projectFormatter("A0014-业务流程",'open'),
                projectFormatter("A0015-数据流图",'close') ,
                projectFormatter("A0017-数据字典",'open')

                ),
    title = c('A0014','A0015','A0017','A0018','A0026','A0027','B0001','B0002','B0003','B0004','B0005','B0010','B0012','B0013','B0014'),
    start   = c("2023-05-17 09:00:00", "2023-05-17 11:00:00", "2023-05-17 14:00:00", "2023-05-17 16:00:00","2023-05-17 09:00:00", "2023-05-17 11:00:00", "2023-05-17 14:00:00", "2023-05-17 16:00:00","2023-05-17 09:00:00", "2023-05-17 11:00:00", "2023-05-17 14:00:00", "2023-05-17 16:00:00","2023-05-17 09:00:00", "2023-05-17 11:00:00", "2023-05-17 14:00:00"),
    end    = c("2023-05-17 11:00:00", "2023-05-17 14:00:00", "2023-05-17 16:00:00", "2023-05-17 18:00:00","2023-05-17 11:00:00", "2023-05-17 14:00:00", "2023-05-17 16:00:00", "2023-05-17 18:00:00","2023-05-17 11:00:00", "2023-05-17 14:00:00", "2023-05-17 16:00:00", "2023-05-17 18:00:00","2023-05-17 11:00:00", "2023-05-17 14:00:00", "2023-05-17 16:00:00"),
    group = c(LETTERS[1:11],LETTERS[1:4])
  )
  return(res)
}
